In [3]:
import numpy as np
import pandas as pd

In [5]:
s1 = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(s1)
print(s1.values)
print(s1.index)

a    1
b    2
c    3
d    4
e    5
dtype: int64
[1 2 3 4 5]
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
dic={'a':10, 'b':20, 'c':30}
s2=pd.Series(dic)
print(s2)
print('------------')
print(s2['a'])
print('------------')
print(s2['a':'c'])
print('------------')
print(s1[0:3])

a    10
b    20
c    30
dtype: int64
------------
10
------------
a    10
b    20
c    30
dtype: int64
------------
a    1
b    2
c    3
dtype: int64

In [14]:
name = ['kim','lee','park','choi']
kor = [80,85,75,90]
eng = [85,75,80,95]
math = [75,85,80,90]

data = {'name':name, 'kor':kor, 'eng':eng, 'math':math}
df = pd.DataFrame(data)
df

   name  kor  eng  math
0   kim   80   85    75
1   lee   85   75    85
2  park   75   80    80
3  choi   90   95    90

In [19]:
score = [kor, eng, math]
arr_score = np.array(score)
arr_score

array([[80, 85, 75, 90],
       [85, 75, 80, 95],
       [75, 85, 80, 90]])

In [26]:
score = [name, kor, eng, math]
df1 = pd.DataFrame(score).T
df1.columns = ['name', 'kor', 'eng', 'math']
df1.index = ['a', 'b', 'c', 'd']
df1

   name kor eng math
a   kim  80  85   75
b   lee  85  75   85
c  park  75  80   80
d  choi  90  95   90

In [28]:
df1.sum()

name    kimleeparkchoi
kor                330
eng                335
math               330
dtype: object

In [30]:
df1.describe()

       name  kor  eng  math
count     4    4    4     4
unique    4    4    4     4
top     kim   80   85    75
freq      1    1    1     1

In [34]:
print(df1.name)
print('-'*20)
print(df1[["name", "kor"]])

a     kim
b     lee
c    park
d    choi
Name: name, dtype: object
--------------------
   name kor
a   kim  80
b   lee  85
c  park  75
d  choi  90

In [39]:
print(df1.loc['b':'c'])
print('-'*20)
print(df1.loc['b':'c',['name','kor']])
print('-'*20)
print(df1.iloc[0:2, [0,3]])

   name kor eng math
b   lee  85  75   85
c  park  75  80   80
--------------------
   name kor
b   lee  85
c  park  75
--------------------
  name math
a  kim   75
b  lee   85